20240228T202130--kdoc-114-indexeddbの使い道__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 114: IndexedDBの使い道</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 114: IndexedDBの使い道</h1>

<div id="outline-container-org25d7426" class="outline-2">
<h2 id="org25d7426"><a href="#org25d7426">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org25d7426">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-28 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd3ddb17" class="outline-2">
<h2 id="orgd3ddb17"><a href="#orgd3ddb17">概要</a></h2>
<div class="outline-text-2" id="text-orgd3ddb17">
<p>
IndexDBにふれる機会があって調べた。使い道を書く。
</p>
</div>
</div>
<div id="outline-container-orge6cdafe" class="outline-2">
<h2 id="orge6cdafe"><a href="#orge6cdafe">イントロ</a></h2>
<div class="outline-text-2" id="text-orge6cdafe">
<p>
IndexedDBは、ブラウザの機能に備え付けられたキーバリュー型DBである。バリューにはJavascriptオブジェクトを格納する。<a href="20210509100112-javascript.html#ID-a6980e15-ecee-466e-9ea7-2c0210243c0d">JavaScript</a>のAPIを使って機能を利用する。
</p>
</div>
</div>
<div id="outline-container-org28ed81c" class="outline-2">
<h2 id="org28ed81c"><a href="#org28ed81c">使いみち</a></h2>
<div class="outline-text-2" id="text-org28ed81c">
<p>
あまり使う機会がない機能であった。何に使われているのだろうか。
</p>

<p>
例えば、UnityをWebGLにビルドしたものを配信するのに使われている。Unityはゲームプログラムを作るときによく使われるが、ゲームはファイルサイズが大きい。プログラムというよりは、テクスチャが多くを占める。たくさんのオブジェクトがマップの広さだけあり、それぞれにテクスチャがあるのを考えると、大きくなりそうなことが想像できる。
</p>

<p>
で、そういった巨大ファイルは通信に時間がかかるのでキャッシュを用いて毎回ダウンロードが走らないようにしたい。しかし、ブラウザのキャッシュには制約があって、サイズの制限があって保存できなかったりする。Unityの場合はそういう背景で、制限の少ないIndexedDBに巨大なキャッシュを保存することでその制限を回避するようだ。
</p>

<p>
ちなみにIndexDBはブラウザのキャッシュとは別なので、通常の流れでキャッシュを削除しても削除されない。Cookieごと全削除か、開発者ツールのIndexedDBから削除する必要がある。
</p>
</div>
</div>
<div id="outline-container-org8e9b114" class="outline-2">
<h2 id="org8e9b114"><a href="#org8e9b114">関連</a></h2>
<div class="outline-text-2" id="text-org8e9b114">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/ja/docs/Web/API/IndexedDB_API">IndexedDB API - Web API | MDN</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
